app/controllers/users_controller.rb

INSERT INTO "users" ("name", "email", "login", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "robson"], ["email", "test@test.co.uk"], ["login", "you"], ["created_at", "2018-03-21 12:17:10.040776"], ["updated_at", "2018-03-21 12:17:10.040776"]]
---
  def create
    @user = User.new(user_params)

    respond_to do |format|
        if @user.save